const agreementWord = `尊敬的用户您好：

本《用户购买协议》(以下统称本协议”)是您与 gemini_mzw523淘宝店(以下统称“行运一番赏”)之间关于行运一番赏提供的购买服务的法律协议。

您若注册行运一番赏并购买和使用了本公司的商品或服务,即表示您认同并接受了本协议。您的使用受制于本协议,请仔细阅读。

一、特别提示 
1、行运一番赏在此特别提醒,请您在使用行运一番赏服务前阅读并充分理解本协议,特别是免除或者限制责任的相应条款。请您审慎阅读并选择接受或不接受本协议。如您勾选同意本协议，并通过注册或其他方式使用行运一番赏的任何服务，即视为您已阅读并接受本服务协议的所有条款。


2、本公司可能因国家政策、发展规划、产品以及履行本协议的环境发生变化等因素,而对行运一番赏或本协议进行修改变更修改或变更的内容将于相关页面进行醒目公告。若您不同意行运一番赏或本协议的前述修改或变更,您可停止使用行运一番赏服务。您继续使用行运一番赏服务即视为您接受并同意本协议所有条款,包括但不限于前述修改及变更内容，请您在勾选同意本协议前谨慎阅读并理解相关内容，如您勾选同意即视为您自此发生的交易均受本协议约束,包括但不限于前述修改及变更内容，如违反本协议约定,行运一番赏有权随时中止或终止服务。

3、如果您未满18周岁,请在法定监护人的陪同下阅读本协议，未成年人行使和履行本协议项下的权利和义务视为已获得了监护人的认可。

4、由于您使用的软件版本、设备、操作系统等不同以及第三方原因可能导致您实际可使用的具体服务有差别,由此可能给您带来不影响实质服务内容的不便,您表示理解,且不会因此向行运一番赏提出任何主张或追究行运一番赏的任何责任。 

二、适用范围 
本协议适用于通过行运一番赏销售的所有商品和服务(以下统称“商品”)。

当您购买行运一番赏目前或将来提供的特殊品类商品(如预售类商品、盲盒等区别于现有的常规在售商品品类的)时,本协议未涉及的和该特殊品类商品展示页中另有规定的(“发货须知”“购买须知”),从其规定，如果本协议与特殊条款有不一致之处,以特殊条款为准 。

三、交易条款 
1、关于商品信息调整 商品名称、价格、数量、型号、规格、尺寸颜色、商品介绍、库存等不影响商品品质的信息随时可能发生变动,行运一番赏不作特别通知，请您至商品页面自行查看。

行运一番赏会尽最大努力保证您所浏览的商品信息的准确性:但由于商品种类繁多、商信息量大以及技术因素等客观原因,商品信息页面显示可能与实际存在误差,将以实际商品为准，您对此表示知悉和理解:此外,由于预售商品存在生产过程的不确定性,相应商品信息(包括但不限于赠品配比、规格尺寸等)可能会因提升品质、改良工艺等而自动跟随官方信息修改,您对此表示知悉和理解

2、关于订单信息：在您提交订单时,请仔细确认所购商品的名称价格、数量、型号、规格、尺寸、颜色、收货人姓名、联系电话、收货地址等信息。
若收货人并非您本人,收货人的行为和意思表示将视为已取得您的授权,您应对收货人的行为及意思表示产生的法律后果承担责任，您提交订单即表示对订单中所确认的订购商品、收货信息等内容的准确性负责。
如果因为您填写的收货人姓名联系电话、收货地址等信息错误,导致延期配送、不能配送、或商品交付给非您本意的收货人,由此造成的损失需由您自行承担:因造成的任何损失或增加费用的,应由您完全独自承担。
您同意并保证:为了更好的为您提供服务,行运一番赏会记录您在选购商品过程中在线填写的所有信息;若有需要可提供给与本次交易相关服务的提供方。

3、关于订单生效
行运一番赏展示的商品和价格等商品信息仅仅作为要约邀请。
您下单时须写明订单信息内容,系统生成的订单信息是计算机信息系统根据您填写的内容和和操作自动生成的数据,作为您向行运一番赏发出的合同要约。
您付款后,即视为双方之间的合同成立，您未能在指定时间完成付款的,行运一番赏有权取消订单。如果您在一份订单里订购了多种商品,但仅就部分商品支付价款,则行运一番赏和之间仅就该部分商品成立合同关系，商品页面所展示赠品兑换券类产品具有随机性的特点,对此您已充分了解。
您应该对您消费行为的性质和后果自行判断,并对您在行运一番赏的一切消费行为完全负责。基于产品特点,我们无法保证您收到的商品完全符合您对某一特定款式或型号的预期,对此,您不应以未收到特定款式的商品为由要求行运一番赏退款、赔偿或承担任何责任。
行运一番赏无法且不会对非因己方责任而导致的任何损失或损害承担责任。如因系统故障或行运一番赏的过失导致显示信息明显不合理的情况(包括但不限于商品价格明显偏低、显示余量明显异常等)请勿进行相关后续操作并立即通知行运一番赏进行修改,行运一番赏有权在法律允许的最大限度内取消相关不合理订单并及时通知您。

4、关于商品缺货的处理
由于国家政策、市场变化、系统问题及其他不可抗力等因素影响,您所提交的订单信息中的商品可能出现缺货，在此情形下,行运一番赏将以有效方式(包括但不限于在行运一番赏发公告、发送邮件、向您提供的联系电话发送手机短信、向您的账号发送私信以及站内信信息等方式)通知您并提供解决方案(包括但不限于取消订单换货、调货等方式)。请您在未收到商品之前留意通知，若行运一番赏超过两次无法与您取得电话联系且您在收到番赏通知超过30天未主动联系在线客服,行运一番赏将有权取消订单,由此给您带来的不便敬请谅解缺货商品是否补货不再另行通知,如您对此商品感兴趣,请您在后续随时保持关注。

四、配送条款
用户付款并填写真实的收货人姓名、有效联系电话、收货地址是商家给用户发货的前提。

1、关于发货时间
您知悉并理解,行运一番赏上列出的发货时间仅作为参考时间，该参考时间可能根据库存状况、送货时间、送货地点、物流状况等客观因素存在误差,具体发货时间以行运一番赏实际发出时间为准。此外,您同样知悉预售类商品的具体发货时间会因受制作周期物流周期、质检返工、不可抗力等诸多因素影响存在误差,导致预售类商品的实际发货时间可能提早或推迟,您对上述情形表示同意及理解。

2、所有预售类商品如后续需要支付运费或祺他费用,将在补款时一并支付。

3、商品的可配送区域为中国大陆地区(特殊偏远地区除外)收件地址在非可配送区域或区域不明确的,务必向客服人员核实清楚后再下单,本公司及行运一番赏对非因己方责任造成的一切纠纷和损失不承担责任。

4、运费视配送地址不同可能不同,具体以订单支付页面显示的价格为准。

5、在签收商品时,请您本人或您指定的收件人亲自在不拆封商品包装的情况下,在快递前当面验货,确认无误后再签收。若您或上述收件人委托他人签收商品或承运人已按您或收件人指示将商品置于指定地点的,视为本人签收。快递一旦签收,视为该商品已交付给您。

6、您无正当理由拒绝签收不支持七天无理由退换货的商品或性质不适宜拒签的商品的,商品返回后,需由您承担物流过程中商品毁损灭失的风险及因此产生的费用。行运一番赏可选择退款或将商品再次发回,若商品性质已不适宜发回或您再次拒绝签收的,订单损失由您承担。

五、支付条款
1、您在使用“买一张”、“买五张”、“买十张”、“全收”等支付功能时因商品可能存在多名用户同时抢购的情况,您应及时注意赠品余量情况,保证支付后购买顺利。

2、您在使用明信片购买时,如遇到赠品数量不足的情况,相应明信片会自动退款至您的小程序账户,退款时受系统影响可能会有延迟情况,请耐心等待。若长时间未收到明信片,请联系客服处理。

六、售后条款
行运一番赏为盲盒类商品,由于其特殊的商品属性，不支持非质量问题七天无理由退换货。

您知悉并理解行运一番赏内商品难免存在轻微蹭色、溢色、气泡染色不均轻微划痕等涂装等原厂非质量问题的瑕疵,上述均属于正常现象,行运一番赏不接受因此提出的退换货申请,请您知悉并谨慎考虑后,理性购买。

若单方面违约，则另一方保留追究法律责任的权利。

七、通知
1、为更好地为您提供服务,您同意接受我们发送的信息,包括但不限于:在行运一番赏发布公告、向您发送邮件、向您提供的联系电话发送手机短信、向您的账号发送私信以及站内信信息向您提供的联系地址邮寄书面通知等。
2、如行运一番赏能够证明以上任何形式的信息已经发送给您或者已在相关页面公布,则视为您已收到相关信息的书面通知,按照提供联系地址交邮后的第五个工作日即视为送达。

3、行运一番赏保留对本小程序注册、购物用户发送订单信息、促销活动等告知服务的权利。如果您在行运一番赏注册、购物,表明您已默认同意接受此项服务。

八、评价
您有权在行运一番赏提供的评价系统中对与您达成交易的商品进行评价。您应当理解,您在行运一番赏的评价信息是公开的，您的所有评价行为应遵守本协议,评价内容应当客观真实,不应含任何污言秽语、政治敏感、色情低俗、广告信息及法律法规列明之其他禁止性信息;您不应以不正当方式利用评价权利对其他用户实施威胁、敲诈勒索。行运一番赏有权对您实施上述行为所产生的评价信息进行删除或屏蔽，并对由此产生的损害向您主张赔偿。

九、其他
1、除非另有证明,储存在行运一番赏服务器上的数据是您使用行运一番赏服务的唯一有效证据。
2、若您存在以下不正当行为,一经发现,行运一番赏有权采取包括但不限于暂停发货、取消订单、拦截已发货的订单、限制账户权限等措施:
(1)、您利用行运一番赏平台进行非法套现、洗钱及其他违法犯罪行为。
(2)、由于用户将其用户密码告知他人或与他人共享注册账号与密码,由此导致的任何个人信息的泄漏,或其他非因番赏原因导致的个人隐私信息的泄露。
(3)、用户自行向第三方公开其个人隐私信息。
(4)、用户与行运一番赏及合作单位之间就用户个人隐私信息的使用公开达成约定,行运一番赏因此向合作单位公开用户个人隐私信息、任何由于黑客攻击、电脑病毒侵入及其他非因行运一番赏原因导致用户个人隐私信息的泄露。
2、用户同意行运一番赏可在以下事项中免费使用用户的个人隐私信息:
(1)、向用户及时发送重要通知,如应用更新、本协议条款的变更。
(2)、行运一番赏内部进行审计、数据分析和研究等,以改进番赏的产品、服务和与用户之间的沟通:
(3)、依本协议约定,行运一番赏管理、审查用户信息及进行处理措施。
(4)、行运一番赏可能将收集到的用户信息,用在其他功能或服务中向用户提供特定内容,包括但不限于展示广告、对用户阅读过的内容进行信息安全类提示、基于特征标签进行间接人群画像并提供更加精准和个性化的服务和内容等。
(5)、符合法律法规规定的其他事项。
3、根据相关法律法规及国家标准,以下情形中,行运一番赏可能会收集、使用、共享、转让、公开披露用户的个人信息,无需征求用户的授权同意:
(1)、与国家安全、国防安全等国家利益直接相关的与公共安全、公共卫生、公众知情等重大公共利益直接相关的。
(2)、与犯罪侦查、起诉、审判和判决执行等直接相关的。
(3)、出于维护用户或其他个人的生命、财产声誉等重大合法权益但又很难得到本人同意的。
(4)、所收集的个人信息是用户自行向社会公众公开的。
(5)、从合法公开披露的信息中收集个人信息的,如合法的新闻报道、政府信息公开等渠道根据用户要求签订和履行合同所必需的。
(6)、用于维护所提供的产品或服务的安全稳定运行所必需的,例如发现、处置产品或服务的故障为开展合法的新闻报道所必需的出于公共利益开展统计或学术研究所必要的。
(7)、法律法规规定的其他情形。
4、我们非常重视对未成年人个人信息的保护。根据相关法律法规的规定,若您是18周岁以下的未成年人,在使用行运一番赏服务前,应事先取得您的家长或法定监护人的同意。
5、行运一番赏将会尽其商业上的合理努力保障用户在本软件及服务中的数据存储安全,但是,行运一番赏并不能就此提供完全保证,包括但不限于以下情形:
(1)、行运一番赏不对用户在本软件及服务中相关数据的删除或储存失败负责。
(2)、行运一番赏有权根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限,并在服务器上为其分配数据最大存储空间等。
(3)、如果用户停止使用本软件及服务或服务被终止或取消,行运一番赏可以从服务器上永久地删除用户数据。服务停止、终止或取消后,行运一番赏没有义务向用户返还任何数据。

十、免责事由
1、您知悉并同意,行运一番赏不因下述任一情况而可能导致的任何损害赔偿承担责任,包括但不限于财产、收益、数据资料等方面的损失或其它无形损失:
(1)、因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素导致系统或服务不能正常运行。
2)、由于黑客攻击、电信部门技术调整或故障、系统维护等原因而造成的系统服务中断或者延迟。
(3)、由于政府命令、法律法规的变更、司法机关及行政机关的命令、裁定等原因而导致的系统服务中断、终止或延迟。
(4)、由于您将账号、密码告知他人或未保管好自己的密码或与他人共享账号或任何其他非行运一番赏的过错,导致您的个人资料泄露。
(5)、由于与行运一番赏链接或合作的其它网站所造成的银行账户信息身份信息泄露及由此而导致的任何法律争议和后果、您(包括未成年人用户)向行运一番赏提供错误、不完整、不实信息等,造成任何损失。如因系统维护或升级的需要而需暂停服务时,我们将尽可能事先进行通知。对于服务的中断或终止而给您造成的任何损失,我们无须对您或任何第三方承担任何责任。
2、您理解行运一番赏对您的任何请求采取行动均需要合理时间,且行运一番赏应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除行运一番赏存在法定过错外,番赏不承担责任。
3、您理解并同意因您自身违反本协议或相关服务条款的规定,导致或产生第三方主张的任何索赔、要求或损失您应当独立承担责任，行运一番赏因此遭受损失的,将向您一并追偿。

十一、投诉指引
番赏一向重视知识产权以及用户权益的保护，如您认为平台某些内容涉嫌侵犯了您的合法权益,您可以通过发送邮件至 【xingyunyfs@163.com】向行运一番赏进行投诉。投诉请求至少应包括以下内容:(1)投诉人的姓名(名称)、联系电话和通讯地址:(2)投诉的具体理由、要求及被投诉内容:(3)构成侵权的初步证明材料。当收到投诉请求后,我们的工作人员会尽快依法为您处理。

十二、 法律适用、争议解决及条款可分割性
1、本协议的订立、效力、解释、执行及其下产生的任何争议的解决应适用并遵守中国法律。
2、因本协议或其违约、终止或无效而产生的或与本协议或其违约、终止或无效有关的任何争议、争论或诉求(争议)应提交宁波仲裁委员会，根据提交争议时该会届时有效的仲裁规则进行仲裁。仲裁庭的仲裁裁决为终局仲裁,对双方均有约束力，双方应尽其最大努力使得任何该等仲裁裁决及时得以执行,并就此提供任何必要的协助。
3、本协议任一条款被视为废止、无效或不可执行,该条款应视为可分割的不应影响其他条款或其任何部分的效力,您与我们仍应善意履行。



gemini_mzw523淘宝店
2022年4月15日`

module.exports = agreementWord